tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/netc_hw/fsl_netc_hw.c
/*
 * Copyright 2022-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_netc_hw.h"

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.netc"
#endif

#if !(defined(FSL_FEATURE_NETC_HAS_NO_SWITCH) && FSL_FEATURE_NETC_HAS_NO_SWITCH)
#define NETC_KC_CFG(x)                                                                   \
    (NETC_SW_ENETC_ISIDKC0CR0_ETP(x.etp) | NETC_SW_ENETC_ISIDKC0CR0_SQTP(x.sqtp) |       \
     NETC_SW_ENETC_ISIDKC0CR0_IPCPP(x.ipcpp) | NETC_SW_ENETC_ISIDKC0CR0_IVIDP(x.ividp) | \
     NETC_SW_ENETC_ISIDKC0CR0_OPCPP(x.opcpp) | NETC_SW_ENETC_ISIDKC0CR0_OVIDP(x.ovidp) | \
     NETC_SW_ENETC_ISIDKC0CR0_SMACP(x.smacp) | NETC_SW_ENETC_ISIDKC0CR0_DMACP(x.dmacp) | \
     NETC_SW_ENETC_ISIDKC0CR0_SPMP(x.spmp) | NETC_SW_ENETC_ISIDKC0CR0_PORTP(x.portp) |   \
     NETC_SW_ENETC_ISIDKC0CR0_VALID(x.valid))
#else
#define NETC_KC_CFG(x)                                                                   \
    (NETC_SW_ENETC_ISIDKC0CR0_ETP(x.etp) | NETC_SW_ENETC_ISIDKC0CR0_SQTP(x.sqtp) |       \
     NETC_SW_ENETC_ISIDKC0CR0_IPCPP(x.ipcpp) | NETC_SW_ENETC_ISIDKC0CR0_IVIDP(x.ividp) | \
     NETC_SW_ENETC_ISIDKC0CR0_OPCPP(x.opcpp) | NETC_SW_ENETC_ISIDKC0CR0_OVIDP(x.ovidp) | \
     NETC_SW_ENETC_ISIDKC0CR0_SMACP(x.smacp) | NETC_SW_ENETC_ISIDKC0CR0_DMACP(x.dmacp) | \
     NETC_SW_ENETC_ISIDKC0CR0_PORTP(x.portp) | NETC_SW_ENETC_ISIDKC0CR0_VALID(x.valid))
#endif

#define NETC_KC_PAYLOAD(x)                                                                                     \
    (NETC_SW_ENETC_ISIDKC0PF0CR_LBMASK(x.lbMask) | NETC_SW_ENETC_ISIDKC0PF0CR_FBMASK(x.fbMask) |               \
     NETC_SW_ENETC_ISIDKC0PF0CR_BYTE_OFFSET(x.byteOffset) | NETC_SW_ENETC_ISIDKC0PF0CR_NUM_BYTES(x.numBytes) | \
     NETC_SW_ENETC_ISIDKC0PF0CR_PFP(x.pfp))

uint16_t NETC_SIGetVsiIndex(netc_vsi_number_t vsi)
{
    uint32_t vsiIdx = (uint32_t)vsi;
    uint16_t index  = 0;

    do
    {
        index++;
        vsiIdx >>= 1U;
    } while ((vsiIdx & 0x1U) == 0U);
    return (index - 1U);
}

void NETC_PSFPKcProfileInit(NETC_SW_ENETC_Type *base, const netc_isi_kc_rule_t *rule, bool enKcPair1)
{
    if (enKcPair1)
    {
#if !(defined(FSL_FEATURE_NETC_HAS_NO_SWITCH) && FSL_FEATURE_NETC_HAS_NO_SWITCH)
        base->ISIDKC2PF0CR = NETC_KC_PAYLOAD(rule[0].payload[0]);
        base->ISIDKC2PF1CR = NETC_KC_PAYLOAD(rule[0].payload[1]);
        base->ISIDKC2PF2CR = NETC_KC_PAYLOAD(rule[0].payload[2]);
        base->ISIDKC2PF3CR = NETC_KC_PAYLOAD(rule[0].payload[3]);
        base->ISIDKC3PF0CR = NETC_KC_PAYLOAD(rule[1].payload[0]);
        base->ISIDKC3PF1CR = NETC_KC_PAYLOAD(rule[1].payload[1]);
        base->ISIDKC3PF2CR = NETC_KC_PAYLOAD(rule[1].payload[2]);
        base->ISIDKC3PF3CR = NETC_KC_PAYLOAD(rule[1].payload[3]);
        base->ISIDKC2CR0   = NETC_KC_CFG(rule[0]);
        base->ISIDKC3CR0   = NETC_KC_CFG(rule[1]);
#endif
    }
    else
    {
        base->ISIDKC0PF0CR = NETC_KC_PAYLOAD(rule[0].payload[0]);
        base->ISIDKC0PF1CR = NETC_KC_PAYLOAD(rule[0].payload[1]);
        base->ISIDKC0PF2CR = NETC_KC_PAYLOAD(rule[0].payload[2]);
        base->ISIDKC0PF3CR = NETC_KC_PAYLOAD(rule[0].payload[3]);
        base->ISIDKC1PF0CR = NETC_KC_PAYLOAD(rule[1].payload[0]);
        base->ISIDKC1PF1CR = NETC_KC_PAYLOAD(rule[1].payload[1]);
        base->ISIDKC1PF2CR = NETC_KC_PAYLOAD(rule[1].payload[2]);
        base->ISIDKC1PF3CR = NETC_KC_PAYLOAD(rule[1].payload[3]);
        base->ISIDKC0CR0   = NETC_KC_CFG(rule[0]);
        base->ISIDKC1CR0   = NETC_KC_CFG(rule[1]);
    }
}

void NETC_RxVlanCInit(NETC_SW_ENETC_Type *base, const netc_vlan_classify_config_t *config, bool enRtag)
{
    base->CVLANR1 =
        NETC_SW_ENETC_CVLANR1_V(config->enableCustom1) | NETC_SW_ENETC_CVLANR1_ETYPE(config->custom1EtherType);
    base->CVLANR2 =
        NETC_SW_ENETC_CVLANR2_V(config->enableCustom2) | NETC_SW_ENETC_CVLANR2_ETYPE(config->custom2EtherType);
    if (enRtag)
    {
#if !(defined(FSL_FEATURE_NETC_HAS_NO_SWITCH) && FSL_FEATURE_NETC_HAS_NO_SWITCH)
        base->PSRTAGETR = NETC_SW_ENETC_PSRTAGETR_ETHERTYPE(config->preStandRTAGType);
#endif
    }
}

void NETC_RxQosCInit(NETC_SW_ENETC_Type *base, const netc_qos_classify_profile_t *profile, bool enProfile1)
{
    uint32_t ipv[2] = {0};
    uint32_t dr     = 0;
    for (uint32_t i = 0U; i < 8U; i++)
    {
        ipv[0] |= ((uint32_t)profile->ipv[i] & NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_0_MASK) << (4U * i);
        ipv[1] |= ((uint32_t)profile->ipv[i + 8U] & NETC_SW_ENETC_VLANIPVMPR0_PCP_DEI_0_MASK) << (4U * i);
    }
    for (uint32_t i = 0U; i < 16U; i++)
    {
        dr |= ((uint32_t)profile->dr[i] & NETC_SW_ENETC_VLANDRMPR_PCP_DEI_0_MASK) << (2U * i);
    }

    if (enProfile1)
    {
#if !(defined(FSL_FEATURE_NETC_HAS_NO_SWITCH) && FSL_FEATURE_NETC_HAS_NO_SWITCH)
        base->NUM_PROFILE[1].VLANIPVMPR0 = ipv[0];
        base->NUM_PROFILE[1].VLANIPVMPR1 = ipv[1];
        base->NUM_PROFILE[1].VLANDRMPR   = dr;
#endif
    }
    else
    {
        base->NUM_PROFILE[0].VLANIPVMPR0 = ipv[0];
        base->NUM_PROFILE[0].VLANIPVMPR1 = ipv[1];
        base->NUM_PROFILE[0].VLANDRMPR   = dr;
    }
}

status_t NETC_CmdBDRInit(netc_cbdr_hw_t *base, const netc_cmd_bdr_config_t *config)
{
    assert((base != NULL) && (config != NULL));
    status_t status = kStatus_Success;
    uint64_t address;

    if ((0U != ((uintptr_t)config->bdBase % 128U)) || (0U != (config->bdLength % 8U)))
    {
        status = kStatus_InvalidArgument;
    }
    else
    {
        /* Map function only supports 32-bit now, so here limit 32-bit first */
#if defined(FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET) && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
        address = MEMORY_ConvertMemoryMapAddress((uintptr_t)config->bdBase, kMEMORY_Local2DMA);
#else
        address = (uintptr_t)config->bdBase;
#endif
        base->CBDRBAR0 = NETC_ADDR_LOW_32BIT(address);
        base->CBDRBAR1 = NETC_ADDR_HIGH_32BIT(address);
        base->CBDRPIR  = 0U;
        base->CBDRCIR  = 0U;
        base->CBDRLENR = (uint32_t)config->bdLength & ENETC_SI_SICBDRLENR_LENGTH_MASK;
        base->CBDRMR |= ENETC_SI_SICBDRMR_EN_MASK;
    }
    return status;
}

