tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/netc_hw/fsl_netc_hw.c
    return status;
}

status_t NETC_DelIPFTableEntry(netc_cbdr_handle_t *handle, uint32_t entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_ipf_req_data_t));
    handle->buffer->ipf.request.entryID                    = entryID;
    handle->buffer->ipf.request.commonHeader.updateActions = 0;
    handle->buffer->ipf.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = sizeof(netc_tb_ipf_req_data_t);
    cmdBd.req.resLength                                    = 4U;
    cmdBd.req.tableId                                      = kNETC_IPFTable;
    cmdBd.req.cmd                                          = kNETC_DeleteEntry;
    cmdBd.req.accessType                                   = kNETC_EntryIDMatch;
    return NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
}

status_t NETC_ResetIPFMatchCounter(netc_cbdr_handle_t *handle, uint32_t entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_ipf_req_data_t));
    handle->buffer->ipf.request.entryID                    = entryID;
    handle->buffer->ipf.request.commonHeader.updateActions = (uint16_t)kNETC_IPFStsEUpdate;
    handle->buffer->ipf.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = sizeof(netc_tb_ipf_req_data_t);
    cmdBd.req.resLength                                    = 4U;
    cmdBd.req.tableId                                      = kNETC_IPFTable;
    cmdBd.req.cmd                                          = kNETC_UpdateEntry;
    cmdBd.req.accessType                                   = kNETC_EntryIDMatch;
    return NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
}

status_t NETC_GetIPFMatchedCount(netc_cbdr_handle_t *handle, uint32_t entryID, uint64_t *count)
{
    status_t status     = kStatus_Success;
    netc_cmd_bd_t cmdBd = {0};

    (void)memset(handle->buffer, 0, sizeof(netc_tb_ipf_req_data_t));
    handle->buffer->ipf.request.entryID                    = entryID;
    handle->buffer->ipf.request.commonHeader.updateActions = 0U;
    handle->buffer->ipf.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = sizeof(netc_tb_ipf_keye_t) + 4U;
    cmdBd.req.resLength                                    = sizeof(netc_tb_ipf_rsp_data_t);
    cmdBd.req.tableId                                      = kNETC_IPFTable;
    cmdBd.req.cmd                                          = kNETC_QueryEntry;
    cmdBd.req.accessType                                   = kNETC_EntryIDMatch;
    status = NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
    if (kStatus_Success == status)
    {
        *count = ((uint64_t)handle->buffer->ipf.response.stse.matchCount[1] << 32U) |
                 handle->buffer->ipf.response.stse.matchCount[0];
    }
    return status;
}

status_t NETC_AddISITableEntry(netc_cbdr_handle_t *handle, netc_tb_isi_config_t *config, uint32_t *entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    status_t status     = kStatus_Success;
    (void)memset(handle->buffer, 0, sizeof(netc_tb_isi_req_data_t));
    /* Add entry to ISI Table and query the ENTRY_ID */
    handle->buffer->isi.request.cfge                       = config->cfge;
    handle->buffer->isi.request.keye                       = config->keye;
    handle->buffer->isi.request.commonHeader.updateActions = 1U;
    /* Query ENTRY_ID only */
    handle->buffer->isi.request.commonHeader.queryActions = 1U;
    cmdBd.req.addr                                        = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                   = sizeof(netc_tb_isi_req_data_t);
    cmdBd.req.resLength                                   = sizeof(netc_tb_isi_rsp_data_t);
    cmdBd.req.tableId                                     = kNETC_ISITable;
    cmdBd.req.cmd                                         = kNETC_AddAndQueryEntry;
    /* Add operation only support Exact Match Key Element Match */
    cmdBd.req.accessType = kNETC_ExactKeyMatch;
    status               = NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
    if (kStatus_Success == status)
    {
        *entryID = handle->buffer->isi.response.entryID;
    }

    return status;
}

status_t NETC_QueryISITableEntry(netc_cbdr_handle_t *handle, uint32_t entryID, netc_tb_isi_config_t *config)
{
    netc_cmd_bd_t cmdBd = {0};
    status_t status     = kStatus_Success;
    (void)memset(handle->buffer, 0, sizeof(netc_tb_isi_req_data_t));
    handle->buffer->isi.request.entryID                    = entryID;
    handle->buffer->isi.request.commonHeader.updateActions = 0U;
    handle->buffer->isi.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = sizeof(netc_tb_isi_req_data_t);
    cmdBd.req.resLength                                    = sizeof(netc_tb_isi_rsp_data_t);
    cmdBd.req.tableId                                      = kNETC_ISITable;
    cmdBd.req.cmd                                          = kNETC_QueryEntry;
    cmdBd.req.accessType                                   = kNETC_EntryIDMatch;
    status = NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
    if (kStatus_Success == status)
    {
        if (0U != cmdBd.resp.numMatched)
        {
            config->keye = handle->buffer->isi.response.keye;
            config->cfge = handle->buffer->isi.response.cfge;
        }
        else
        {
            status = kStatus_NETC_NotFound;
        }
    }

