tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/netc_hw/fsl_netc_hw.c
    return status;
}

status_t NETC_UpdateISFTableEntry(netc_cbdr_handle_t *handle, uint32_t entryID, netc_tb_isf_cfge_t *cfg)
{
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_isi_req_data_t));
    /* Update entry in ISF Table base on the ENTRY_ID */
    handle->buffer->isf.request.cfge                       = *cfg;
    handle->buffer->isf.request.entryID                    = entryID;
    handle->buffer->isf.request.commonHeader.updateActions = 1U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = sizeof(netc_tb_isf_req_data_t);
    cmdBd.req.resLength                                    = sizeof(netc_tb_isf_rsp_data_t);
    cmdBd.req.tableId                                      = kNETC_ISFTable;
    cmdBd.req.cmd                                          = kNETC_UpdateEntry;
    cmdBd.req.accessType                                   = kNETC_EntryIDMatch;
    return NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
}

status_t NETC_DelISFTableEntry(netc_cbdr_handle_t *handle, uint32_t entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_isf_req_data_t));
    handle->buffer->isf.request.entryID                    = entryID;
    handle->buffer->isf.request.commonHeader.updateActions = 0;
    handle->buffer->isf.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = 12U;
    cmdBd.req.resLength                                    = 4U;
    cmdBd.req.tableId                                      = kNETC_ISFTable;
    cmdBd.req.cmd                                          = kNETC_DeleteEntry;
    cmdBd.req.accessType                                   = kNETC_EntryIDMatch;
    return NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
}

status_t NETC_QueryISFTableEntry(netc_cbdr_handle_t *handle, netc_tb_isf_keye_t *keye, netc_tb_isf_rsp_data_t *rsp)
{
    netc_cmd_bd_t cmdBd = {0};
    status_t status     = kStatus_Success;
    (void)memset(handle->buffer, 0, sizeof(netc_tb_isf_req_data_t));
    handle->buffer->isf.request.keye                       = *keye;
    handle->buffer->isf.request.commonHeader.updateActions = 0U;
    handle->buffer->isf.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = sizeof(netc_tb_isf_req_data_t);
    cmdBd.req.resLength                                    = sizeof(netc_tb_isf_rsp_data_t);
    cmdBd.req.tableId                                      = kNETC_ISFTable;
    cmdBd.req.cmd                                          = kNETC_QueryEntry;
    cmdBd.req.accessType                                   = kNETC_ExactKeyMatch;
    status = NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
    if (kStatus_Success == status)
    {
        if (0U != cmdBd.resp.numMatched)
        {
            *rsp = handle->buffer->isf.response;
        }
        else
        {
            status = kStatus_NETC_NotFound;
        }
    }
    return status;
}

status_t NETC_AddISCTableEntry(netc_cbdr_handle_t *handle, uint32_t entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_isi_req_data_t));
    /* Add entry to ISC Table according to the ENTRY_ID (ISC_EID) */
    handle->buffer->isc.request.entryID                    = entryID;
    handle->buffer->isc.request.commonHeader.updateActions = 0U;
    handle->buffer->isc.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = sizeof(netc_tb_isc_req_data_t);
    cmdBd.req.resLength                                    = sizeof(netc_tb_isc_rsp_data_t);
    cmdBd.req.tableId                                      = kNETC_ISCTable;
    cmdBd.req.cmd                                          = kNETC_AddEntry;
    /* Only support ID Match Key Element Match */
    cmdBd.req.accessType = kNETC_EntryIDMatch;
    return NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
}

status_t NETC_GetISCStatistic(netc_cbdr_handle_t *handle, uint32_t entryID, netc_tb_isc_stse_t *statistic)
{
    netc_cmd_bd_t cmdBd = {0};
    status_t status     = kStatus_Success;
    (void)memset(handle->buffer, 0, sizeof(netc_tb_isc_req_data_t));
    handle->buffer->isc.request.entryID                    = entryID;
    handle->buffer->isc.request.commonHeader.updateActions = 0U;
    handle->buffer->isc.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = sizeof(netc_tb_isc_req_data_t);
    cmdBd.req.resLength                                    = sizeof(netc_tb_isc_rsp_data_t);
    cmdBd.req.tableId                                      = kNETC_ISCTable;
    cmdBd.req.cmd                                          = kNETC_QueryEntry;
    /* Only support ID Match Key Element Match */
    cmdBd.req.accessType = kNETC_EntryIDMatch;
    status               = NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
    if (kStatus_Success == status)
    {
        *statistic = handle->buffer->isc.response.stse;
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_052206) && FSL_FEATURE_NETC_HAS_ERRATA_052206)
        /* ERR052206: The actual offset of the SG_DROP_COUNT in the Ingress Stream Count Table STSE_DATA element is bit
           199 or the offset within the entire Ingress Stream Count Table Response Data Buffer format is bit 231.
           Starting offset from defined is 7-bits. */
        statistic->sgDropCount >>= 7U;
        statistic->sgDropCount += ((statistic->res3 & 0x7FU) << 25U);
#else
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_052134) && FSL_FEATURE_NETC_HAS_ERRATA_052134)
        /* ERR052134: The actual offset of the SG_DROP_COUNT in the Ingress Stream Count Table STSE_DATA element is bit
           200 or the offset within the entire Ingress Stream Count Table Response Data Buffer format is bit 232.
           Starting offset is 8-bits.
           Note: For i.MXRT1189 the ERR052134 is described in the Reference Manual NETC section. */
        statistic->sgDropCount >>= 8U;
        statistic->sgDropCount += ((statistic->res3 & 0xFFU) << 24U);
#endif
#endif
    }
    return status;
}

status_t NETC_ResetISCStatistic(netc_cbdr_handle_t *handle, uint32_t entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_isc_req_data_t));
    /* Reset ISC Table according to the ENTRY_ID (ISC_EID) */
    handle->buffer->isc.request.entryID                    = entryID;
    handle->buffer->isc.request.commonHeader.updateActions = 1U;
    handle->buffer->isc.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = sizeof(netc_tb_isc_req_data_t);
    cmdBd.req.resLength                                    = sizeof(netc_tb_isc_rsp_data_t);
    cmdBd.req.tableId                                      = kNETC_ISCTable;
    cmdBd.req.cmd                                          = kNETC_UpdateEntry;
    /* Only support ID Match Key Element Match */
    cmdBd.req.accessType = kNETC_EntryIDMatch;
    return NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
}

