tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/netc_hw/fsl_netc_hw.c
status_t NETC_AddOrUpdateSGITableEntry(netc_cbdr_handle_t *handle, netc_tb_sgi_config_t *config, bool isAdd)
{
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_sgi_req_data_t));
    /* Add entry to SGI Table */
    handle->buffer->sgi.request.acfge   = config->acfge;
    handle->buffer->sgi.request.cfge    = config->cfge;
    handle->buffer->sgi.request.icfge   = config->icfge;
    handle->buffer->sgi.request.entryID = config->entryID;
    handle->buffer->sgi.request.commonHeader.updateActions =
        (uint16_t)kNETC_SGIAcfEUpdate | (uint16_t)kNETC_SGICfgEUpdate | (uint16_t)kNETC_SGISgisEUpdate;
    handle->buffer->sgi.request.commonHeader.queryActions = 0U;
    cmdBd.req.addr                                        = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                   = sizeof(netc_tb_sgi_req_data_t);
    cmdBd.req.resLength                                   = sizeof(netc_tb_sgi_rsp_data_t);
    cmdBd.req.tableId                                     = kNETC_SGITable;
    if (isAdd)
    {
        cmdBd.req.cmd = kNETC_AddEntry;
    }
    else
    {
        cmdBd.req.cmd = kNETC_UpdateEntry;
    }
    cmdBd.req.accessType = kNETC_EntryIDMatch;
    return NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
}

status_t NETC_ResetIRXOEXSGITableEntry(netc_cbdr_handle_t *handle, uint32_t entryID)
{
    status_t status;
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_sgi_req_data_t));
    handle->buffer->sgi.request.entryID                    = entryID;
    handle->buffer->sgi.request.commonHeader.updateActions = (uint16_t)kNETC_SGISgisEUpdate;
    handle->buffer->sgi.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = sizeof(netc_tb_sgi_req_data_t);
    cmdBd.req.resLength                                    = 0U;
    cmdBd.req.tableId                                      = kNETC_SGITable;
    cmdBd.req.cmd                                          = kNETC_UpdateEntry;
    cmdBd.req.accessType                                   = kNETC_EntryIDMatch;
    status = NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
    if (kStatus_Success == status)
    {
        if (cmdBd.resp.numMatched == 0U)
        {
            status = kStatus_NETC_NotFound;
        }
        else
        {
            /* Intentional empty */
        }
    }

    return status;
}

status_t NETC_DelSGITableEntry(netc_cbdr_handle_t *handle, uint32_t entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_sgi_req_data_t));
    /* Delete entry in SGI Table */
    handle->buffer->sgi.request.entryID                    = entryID;
    handle->buffer->sgi.request.commonHeader.updateActions = 0U;
    handle->buffer->sgi.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = sizeof(netc_tb_sgi_req_data_t);
    cmdBd.req.resLength                                    = sizeof(netc_tb_sgi_rsp_data_t);
    cmdBd.req.tableId                                      = kNETC_SGITable;
    cmdBd.req.cmd                                          = kNETC_DeleteEntry;
    cmdBd.req.accessType                                   = kNETC_EntryIDMatch;
    return NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
}

status_t NETC_GetSGIState(netc_cbdr_handle_t *handle, uint32_t entryID, netc_tb_sgi_sgise_t *statis)
{
    netc_cmd_bd_t cmdBd = {0};
    status_t status     = kStatus_Success;
    (void)memset(handle->buffer, 0, sizeof(netc_tb_sgi_req_data_t));
    handle->buffer->sgi.request.entryID                    = entryID;
    handle->buffer->sgi.request.commonHeader.updateActions = 0U;
    handle->buffer->sgi.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = 8U;
    cmdBd.req.resLength                                    = sizeof(netc_tb_sgi_rsp_data_t);
    cmdBd.req.tableId                                      = kNETC_SGITable;
    cmdBd.req.cmd                                          = kNETC_QueryEntry;
    cmdBd.req.accessType                                   = kNETC_EntryIDMatch;
    status = NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
    if (kStatus_Success == status)
    {
        *statis = handle->buffer->sgi.response.sgise;
    }
    return status;
}

status_t NETC_QuerySGITableEntry(netc_cbdr_handle_t *handle, uint32_t entryID, netc_tb_sgi_config_t *cfg)
{
    netc_cmd_bd_t cmdBd = {0};
    status_t status     = kStatus_Success;
    (void)memset(handle->buffer, 0, sizeof(netc_tb_sgi_req_data_t));
    handle->buffer->sgi.request.entryID                    = entryID;
    handle->buffer->sgi.request.commonHeader.updateActions = 0U;
    handle->buffer->sgi.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = 8U;
    cmdBd.req.resLength                                    = sizeof(netc_tb_sgi_rsp_data_t);
    cmdBd.req.tableId                                      = kNETC_SGITable;
    cmdBd.req.cmd                                          = kNETC_QueryEntry;
    cmdBd.req.accessType                                   = kNETC_EntryIDMatch;
    status = NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
    if (kStatus_Success == status)
    {
        if (cmdBd.resp.numMatched != 0U)
        {
            cfg->cfge  = handle->buffer->sgi.response.cfge;
            cfg->icfge = handle->buffer->sgi.response.icfge;
            cfg->acfge = handle->buffer->sgi.response.acfge;
        }
        else
        {
            status = kStatus_NETC_NotFound;
        }
    }

