tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/netc_hw/fsl_netc_hw.c
    return status;
}

status_t NETC_AddSGCLTableEntry(netc_cbdr_handle_t *handle, netc_tb_sgcl_gcl_t *config)
{
    netc_cmd_bd_t cmdBd = {0};

    if ((config->numEntries > NETC_TB_SGCL_MAX_ENTRY) || (config->numEntries == 0U) || (config->gcList == NULL))
    {
        return kStatus_InvalidArgument;
    }
    (void)memset(handle->buffer, 0, 24U + config->numEntries * 8U);
    handle->buffer->sgcl.request.entryID                    = config->entryID;
    handle->buffer->sgcl.request.commonHeader.updateActions = 0U;
    handle->buffer->sgcl.request.commonHeader.queryActions  = 0U;
    /* Initialize Stream Gate Control List entry */
    handle->buffer->sgcl.request.cfge.cycleTime = config->cycleTime;
    /* The entry numbers is LIST_LENGTH -1 */
    handle->buffer->sgcl.request.cfge.listLength = (uint8_t)(config->numEntries - 1U);
    handle->buffer->sgcl.request.cfge.extOipv    = config->extOipv;
    handle->buffer->sgcl.request.cfge.extIpv     = config->extIpv;
    handle->buffer->sgcl.request.cfge.extCtd     = config->extCtd;
    handle->buffer->sgcl.request.cfge.extGtst    = config->extGtst;
    (void)memcpy(&handle->buffer->sgcl.request.cfge.ges[0], config->gcList, config->numEntries * 8U);
    cmdBd.req.addr       = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength  = 24U + config->numEntries * 8U;
    cmdBd.req.resLength  = 0U;
    cmdBd.req.tableId    = kNETC_SGCLTable;
    cmdBd.req.cmd        = kNETC_AddEntry;
    cmdBd.req.accessType = kNETC_EntryIDMatch;
    return NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
}

status_t NETC_DelSGCLTableEntry(netc_cbdr_handle_t *handle, uint32_t entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_sgcl_req_data_t));
    handle->buffer->sgcl.request.entryID                    = entryID;
    handle->buffer->sgcl.request.commonHeader.updateActions = 0U;
    handle->buffer->sgcl.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                          = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                     = 8U;
    cmdBd.req.resLength                                     = 0U;
    cmdBd.req.tableId                                       = kNETC_SGCLTable;
    cmdBd.req.cmd                                           = kNETC_DeleteEntry;
    cmdBd.req.accessType                                    = kNETC_EntryIDMatch;
    return NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
}

status_t NETC_GetSGCLGateList(netc_cbdr_handle_t *handle, netc_tb_sgcl_gcl_t *gcl, uint32_t length)
{
    status_t status     = kStatus_Success;
    netc_cmd_bd_t cmdBd = {0};
    if (gcl->gcList == NULL)
    {
        return kStatus_InvalidArgument;
    }
    (void)memset(handle->buffer, 0, sizeof(netc_tb_sgcl_req_data_t));
    handle->buffer->sgcl.request.entryID                    = gcl->entryID;
    handle->buffer->sgcl.request.commonHeader.updateActions = 0U;
    handle->buffer->sgcl.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                          = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                     = 8U;
    cmdBd.req.resLength                                     = sizeof(netc_tb_sgcl_data_t);
    cmdBd.req.tableId                                       = kNETC_SGCLTable;
    cmdBd.req.cmd                                           = kNETC_QueryEntry;
    cmdBd.req.accessType                                    = kNETC_EntryIDMatch;
    status = NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
    if (kStatus_Success == status)
    {
        if (cmdBd.resp.numMatched != 0U)
        {
            if (((uint32_t)handle->buffer->sgcl.request.cfge.listLength + 1U) > length)
            {
                status = kStatus_InvalidArgument;
            }
            else
            {
                gcl->cycleTime = handle->buffer->sgcl.request.cfge.cycleTime;
                /* The entry numbers is LIST_LENGTH -1 */
                gcl->numEntries = (uint32_t)handle->buffer->sgcl.request.cfge.listLength + 1U;
                gcl->extOipv    = handle->buffer->sgcl.request.cfge.extOipv;
                gcl->extIpv     = handle->buffer->sgcl.request.cfge.extIpv;
                gcl->extCtd     = handle->buffer->sgcl.request.cfge.extCtd;
                gcl->extGtst    = handle->buffer->sgcl.request.cfge.extGtst;
                (void)memcpy(gcl->gcList, &handle->buffer->sgcl.request.cfge.ges[0], gcl->numEntries * 8U);
            }
        }
        else
        {
            status = kStatus_NETC_NotFound;
        }
    }
    return status;
}
status_t NETC_GetSGCLState(netc_cbdr_handle_t *handle, uint32_t entryID, netc_tb_sgcl_sgclse_t *state)
{
    status_t status     = kStatus_Success;
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_sgcl_req_data_t));
    handle->buffer->sgcl.request.entryID                    = entryID;
    handle->buffer->sgcl.request.commonHeader.updateActions = 0U;
    handle->buffer->sgcl.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                          = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                     = 8U;
    cmdBd.req.resLength                                     = sizeof(netc_tb_sgcl_data_t);
    cmdBd.req.tableId                                       = kNETC_SGCLTable;
    cmdBd.req.cmd                                           = kNETC_QueryEntry;
    cmdBd.req.accessType                                    = kNETC_EntryIDMatch;
    status = NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
    if (kStatus_Success == status)
    {
        *state = handle->buffer->sgcl.response.sgclse;
    }
    return status;
}

status_t NETC_AddOrUpdateRPTableEntry(netc_cbdr_handle_t *handle, netc_tb_rp_config_t *config, netc_tb_cmd_t cmd)
{
    status_t status;
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_rp_req_data_t));
    /* Add or Update entry to Rate Policer Table */
    handle->buffer->rp.request.entryID                    = config->entryID;
    handle->buffer->rp.request.cfge                       = config->cfge;
    handle->buffer->rp.request.fee                        = config->fee;
    handle->buffer->rp.request.commonHeader.updateActions = (uint16_t)kNETC_RPCfgEUpdate | (uint16_t)kNETC_RPFeEUpdate;
    handle->buffer->rp.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                        = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                   = sizeof(netc_tb_rp_req_data_t);
    cmdBd.req.resLength                                   = 0U;
    cmdBd.req.tableId                                     = kNETC_RPTable;
    cmdBd.req.cmd                                         = cmd;

    /* Only support Entry ID Match */
    cmdBd.req.accessType = kNETC_EntryIDMatch;
    status               = NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
    if (kStatus_Success == status)
    {
        if ((cmd == kNETC_AddEntry) && (cmdBd.resp.numMatched > 0U))
        {
            status = kStatus_NETC_EntryExists;
        }
        else if ((cmd == kNETC_UpdateEntry) && (cmdBd.resp.numMatched == 0U))
        {
            status = kStatus_NETC_NotFound;
        }
        else
        {
            /* Intentional empty */
        }
    }

