tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/netc_hw/fsl_netc_hw.c
    return status;
}

status_t NETC_ResetMRRPTableEntry(netc_cbdr_handle_t *handle, uint32_t entryID)
{
    status_t status;
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_rp_req_data_t));
    handle->buffer->rp.request.entryID                    = entryID;
    handle->buffer->rp.request.commonHeader.updateActions = (uint16_t)kNETC_RPPsEUpdate;
    handle->buffer->rp.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                        = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                   = sizeof(netc_tb_rp_req_data_t);
    cmdBd.req.resLength                                   = 0U;
    cmdBd.req.tableId                                     = kNETC_RPTable;
    cmdBd.req.cmd                                         = kNETC_UpdateEntry;

    /* Only support Entry ID Match */
    cmdBd.req.accessType = kNETC_EntryIDMatch;
    status               = NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
    if (kStatus_Success == status)
    {
        if (cmdBd.resp.numMatched == 0U)
        {
            status = kStatus_NETC_NotFound;
        }
        else
        {
            /* Intentional empty */
        }
    }

    return status;
}

status_t NETC_DelRPTableEntry(netc_cbdr_handle_t *handle, uint32_t entryID)
{
    netc_cmd_bd_t cmdBd = {0};
    (void)memset(handle->buffer, 0, sizeof(netc_tb_rp_req_data_t));
    handle->buffer->rp.request.entryID                    = entryID;
    handle->buffer->rp.request.commonHeader.updateActions = 0;
    handle->buffer->rp.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                        = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                   = 8U;
    cmdBd.req.resLength                                   = 0U;
    cmdBd.req.tableId                                     = kNETC_RPTable;
    cmdBd.req.cmd                                         = kNETC_DeleteEntry;
    cmdBd.req.accessType                                  = kNETC_EntryIDMatch;
    return NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
}

status_t NETC_QueryRPTableEntry(netc_cbdr_handle_t *handle, uint32_t entryID, netc_tb_rp_rsp_data_t *rsp)
{
    netc_cmd_bd_t cmdBd = {0};
    status_t status     = kStatus_Success;
    (void)memset(handle->buffer, 0, sizeof(netc_tb_rp_rsp_data_t));
    handle->buffer->rp.request.entryID                    = entryID;
    handle->buffer->rp.request.commonHeader.updateActions = 0;
    handle->buffer->rp.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                        = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                   = 8U;
    cmdBd.req.resLength                                   = sizeof(netc_tb_rp_rsp_data_t);
    cmdBd.req.tableId                                     = kNETC_RPTable;
    cmdBd.req.cmd                                         = kNETC_QueryEntry;
    cmdBd.req.accessType                                  = kNETC_EntryIDMatch;
    status = NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
    if (kStatus_Success == status)
    {
        if (cmdBd.resp.numMatched != 0U)
        {
            *rsp = handle->buffer->rp.response;
        }
        else
        {
            status = kStatus_NETC_NotFound;
        }
    }
    return status;
}

status_t NETC_GetRPStatistic(netc_cbdr_handle_t *handle, uint32_t entryID, netc_tb_rp_stse_t *statis)
{
    netc_cmd_bd_t cmdBd = {0};
    status_t status     = kStatus_Success;
    (void)memset(handle->buffer, 0, sizeof(netc_tb_rp_req_data_t));
    handle->buffer->rp.request.entryID                    = entryID;
    handle->buffer->rp.request.commonHeader.updateActions = 0;
    handle->buffer->rp.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                        = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                   = 8U;
    cmdBd.req.resLength                                   = sizeof(netc_tb_rp_rsp_data_t);
    cmdBd.req.tableId                                     = kNETC_RPTable;
    cmdBd.req.cmd                                         = kNETC_QueryEntry;
    cmdBd.req.accessType                                  = kNETC_EntryIDMatch;
    status = NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
    if (kStatus_Success == status)
    {
        *statis = handle->buffer->rp.response.stse;
    }
    return status;
}

status_t NETC_ConfigTGSAdminList(netc_cbdr_handle_t *handle, netc_tb_tgs_gcl_t *config)
{
    status_t status     = kStatus_Success;
    netc_cmd_bd_t cmdBd = {0};

    if ((config->numEntries > NETC_TB_TGS_MAX_ENTRY) || ((config->numEntries != 0U) && (config->gcList == NULL)))
    {
        return kStatus_InvalidArgument;
    }

    (void)memset(handle->buffer, 0, 28U);
    handle->buffer->tgs.request.entryID                    = config->entryID;
    handle->buffer->tgs.request.commonHeader.updateActions = 1U;
    handle->buffer->tgs.request.commonHeader.queryActions  = 0U;
    /* Initialize port Time Gate Scheduling entry administrative gate control list */
    (void)memcpy((void *)&handle->buffer->tgs.request.cfge, (void *)&config->baseTime, 20);
    if (0U != config->numEntries)
    {
        (void)memcpy((void *)&handle->buffer->tgs.request.cfge.adminGcl[0], (void *)config->gcList,
                     config->numEntries * 8U);
    }
    cmdBd.req.addr       = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength  = 28U + config->numEntries * 8U;
    cmdBd.req.resLength  = 12U;
    cmdBd.req.tableId    = kNETC_TGSTable;
    cmdBd.req.cmd        = kNETC_UpdateEntry;
    cmdBd.req.accessType = kNETC_EntryIDMatch;
    status               = NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);

#if defined(FSL_FEATURE_NETC_HAS_ERRATA_051254) && FSL_FEATURE_NETC_HAS_ERRATA_051254
    if (cmdBd.resp.error == 0xd6U)
    {
        /* If a command response with an error code set to 0x0D6 is returned in response to an update command request
         * against an Time Gate Scheduling table entry, software must issue another update command request against the
         * same Time Gate Scheduling table entry, to remove the administrative gate control list from the Time Gate
         * Scheduling table entry. */
        (void)memset(handle->buffer, 0, 28U);
        handle->buffer->tgs.request.cfge.adminControlListLength = 0U;
        handle->buffer->tgs.request.entryID                     = config->entryID;
        handle->buffer->tgs.request.commonHeader.updateActions  = 1U;
        handle->buffer->tgs.request.commonHeader.queryActions   = 0U;
        cmdBd.req.addr                                          = (uintptr_t)handle->buffer;
        cmdBd.req.reqLength                                     = 28U;
        cmdBd.req.resLength                                     = 12U;
        cmdBd.req.tableId                                       = kNETC_TGSTable;
        cmdBd.req.cmd                                           = kNETC_UpdateEntry;
        cmdBd.req.accessType                                    = kNETC_EntryIDMatch;
        (void)NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
    }
#endif
    return status;
}

status_t NETC_GetTGSOperationList(netc_cbdr_handle_t *handle, netc_tb_tgs_gcl_t *gcl, uint32_t length)
{
    status_t status     = kStatus_Success;
    netc_cmd_bd_t cmdBd = {0};
    uint32_t adminLen;
    netc_tb_tgs_olse_t *resOlseBase;
    if (gcl->gcList == NULL)
    {
        return kStatus_InvalidArgument;
    }
    (void)memset(handle->buffer, 0, sizeof(netc_tb_tgs_req_data_t));
    handle->buffer->tgs.request.entryID                    = gcl->entryID;
    handle->buffer->tgs.request.commonHeader.updateActions = 0U;
    handle->buffer->tgs.request.commonHeader.queryActions  = 0U;
    cmdBd.req.addr                                         = (uintptr_t)handle->buffer;
    cmdBd.req.reqLength                                    = 8U;
    /* Set Response Data Buffer length to MAX */
    cmdBd.req.resLength  = sizeof(netc_tb_tgs_data_t);
    cmdBd.req.tableId    = kNETC_TGSTable;
    cmdBd.req.cmd        = kNETC_QueryEntry;
    cmdBd.req.accessType = kNETC_EntryIDMatch;
    status               = NETC_CmdBDSendCommand(handle->base, handle->cmdr, &cmdBd, kNETC_NtmpV2_0);
    if (kStatus_Success == status)
    {
        /* Get the administrative gate control list length from Response Data Buffer */
        adminLen    = handle->buffer->tgs.response.cfge.adminControlListLength;
        resOlseBase = (netc_tb_tgs_olse_t *)(uintptr_t)(&((uint8_t *)handle->buffer)[36U + 8U * adminLen]);
        if (resOlseBase->operControlListLength > length)
        {
            status = kStatus_InvalidArgument;
        }
        else
        {
            gcl->baseTime   = resOlseBase->operBaseTime;
            gcl->cycleTime  = resOlseBase->operCycleTime;
            gcl->extTime    = resOlseBase->operCycleTimeExt;
            gcl->numEntries = resOlseBase->operControlListLength;
            /* Copy the Operational gate control list length */
            (void)memcpy(gcl->gcList, &resOlseBase->operGcl[0], (gcl->numEntries * 8U));
        }
    }
    return status;
}
